def dijkstra(startnode):

  # 0 Initialisierung

     NB = {"a": {"k": 3, "d": 4},
           "b": {"k": 4, "c": 4.5, "l": 9},
           "c": {"k": 3, "b": 4.5, "l": 8, "e": 4.5, "g": 3, "j": 4},
           "d": {"a": 4, "k": 5, "j": 2.5, "h": 6},
          "e": {"c": 4.5, "g": 3.5, "i": 3.5},
           "f": {"j": 4, "o": 3, "p": 2},
           "g": {"j": 5, "c": 3, "e": 3.5, "i": 3},
           "h": {"d": 6, "j": 4, "o": 3},
           "i": {"g": 3, "e": 3.5, "q": 4, "n": 4, "p": 3.5},
           "j": {"d": 2.5, "c": 4, "g": 5, "f": 4, "h": 4},
           "k": {"a": 3, "d": 5, "c": 3, "b": 4},
           "l": {"b": 9, "c": 8, "q": 3},
           "m": {"o": 4, "p": 2.5, "n": 3},
           "n": {"m": 3, "i": 4, "q": 3.5},
           "o": {"h": 3, "f": 3, "p": 3, "m": 4},
           "p": {"o": 3, "f": 2, "m": 2.5, "i": 3.5},
           "q": {"n": 3.5, "i": 4, "l": 3}
           }

     MK = [@@@@@@@@@@@@@@@@@@@@@@@@@@@@@]
     D = @@@@@@@@@@@@@@@@@@@@@@@@@@@@@
     R = {"a": [], "b": [], "c": [], "d": [], "e": [], "f": [], "g": [], "h": [], "i": [], "j": [], "k": [], "l": [],
          "m": [], "n": [], "o": [], "p": [], "q": []}

     D[startnode] = @@@@@@@@@@@@@@@@@@@@@@@@@@@@@

  # Iterationen
  # Abbruch
     while len(MK) != @@@@@@@@@@@@@@@@@@@@@@@@@@@@@ :

         # 1 Wähle den Knoten ℎ aus 𝑀𝐾 mit 𝐷[ℎ]=min {𝐷[𝑖]|𝑖∈𝑀𝐾}
         dis_start = 999999
         for node in MK:
             dis_start_node = D[node]
             if @@@@@@@@@@@@@ < @@@@@@@@@@@@@ :
                 new_node = @@@@@@@@@@@@@@@@@@@@@@@@@@@@@
                 dis_start = @@@@@@@@@@@@@@@@@@@@@@@@@@@@@
         current_node = new_node

         # 2 for (all) 𝑗∈NB(ℎ) do
         # 		if 𝐷[𝑗]> 𝐷[ℎ]+𝑐_ℎ𝑗   then   𝐷[𝑗]≔𝐷[ℎ]+𝑐_ℎ𝑗; 𝑅[𝑗]≔ℎ; 𝑀𝐾≔𝑀𝐾 ∪{𝑗}
         for neighbour in NB[current_node]:
             if @@@@@@@@@@@@@@@@@@@@@@@@@@@@@ :
                 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@
                 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@.append(current_node)
                 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@.append(neighbour)
                 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@.extend(R[current_node])

         # 3 Eliminiere ℎ aus 𝑀𝐾
         @@@@@@@@@@@@@@@@@@@@@@@@@@@@@.remove(current_node)

     R[startnode] = [startnode]
     return R


print(dijkstra("a"))

